/*
Шаблон скрипта после развертывания							
--------------------------------------------------------------------------------------
 В данном файле содержатся инструкции SQL, которые будут добавлены в скрипт построения.		
 Используйте синтаксис SQLCMD для включения файла в скрипт после развертывания.			
 Пример:      :r .\myfile.sql								
 Используйте синтаксис SQLCMD для создания ссылки на переменную в скрипте после развертывания.		
 Пример:      :setvar TableName MyTable							
               SELECT * FROM [$(TableName)]					
--------------------------------------------------------------------------------------
*/
 
INSERT INTO dbo.Groups (Title) VALUES (N'GR-01'), (N'GR-02');

INSERT INTO dbo.Students (FirstName, LastName, Birthday, Course, GroupId) VALUES
(N'Petro', N'Petrenko', '2003-05-12', 1, 1),
(N'Semen', N'Semenchenko', '2002-03-01', 1, 1),
(N'Sergiy', N'Shevchenko', '2001-12-01', 2, 2),
(N'Anna', N'Sinitsa', '2004-01-15', 2, 2);